public/autobiography/high-school.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../index.html">Giovanni's Diary</a> &gt; <a href="chronological.html">Chronological</a> &gt;
</p>

<div id="outline-container-orgdeaa1ed" class="outline-2">
<h2 id="orgdeaa1ed">High School</h2>
<div class="outline-text-2" id="text-orgdeaa1ed">
<p>
I attended a Liceo Scientifico in my city, which focuses on scientific
subjects.
</p>

<p>
Out of frustration, I decided to quit youtube since my perfectionism
was making me anxious and depressed: everything had to be perfect and
I could not allow myself any errors. I started playing some other
<a href="../stash/videogames/videogames.html">games</a> instead like Skyrim and Dark Souls 1 (fun story, I broke a
monitor while playing DS1).
</p>

<p>
During this time I participated in several programming Olympiads and
cybersecurity competitions. I was doing good in the competitions,
reaching nationals every time.  More specifically, I participated in
the cyberchallenge which is an university CTF competition and I
arrived first place and competed in the nationals. During this time, I
met probably the greatest programmer I know, Leonardo Taccari, which
is part of the board of NetBSD and a true UNIX fellow. I asked him
suggestions about books to learn UNIX and he suggested me <a href="../programming/apue.html">"Advanced
Programming in the Unix Environment"</a>, a book that I bought and read
all the way in the following months. Later this book would influence
me to dig deeper in operating systems and UNIX kernels and stay close
to the operating systems world. It was clear to me I wanted to be a
<a href="../programming/programming.html">computer scientist</a>.
</p>

<p>
<a href="high-school-2.html">Continue</a>
</p>

<hr />

<p>
&gt; <a href="early-life.html">Early Life</a> &gt; <a href="middle-school.html">Middle School</a> &gt; High School 1 &gt; <a href="high-school-2.html">High School 2</a> &gt; <a href="university.html">University</a> &gt; &#x2026;
</p>
</div>
</div>
</div>
</body>
</html>
